In [1]:
import sys
sys.path.append("..")

from database_handler import DatabaseHandler

### Exploratory Data Analysis

In [2]:
db_handler = DatabaseHandler("../data/database/stocks.db")
stock_info = db_handler.fetch_stock_info()
stock_info

,tic,name,sector,last_update,spx_status,active
0,AABA,None,Financials,2017-04-18,0,0
1,AAP,None,Consumer Discretionary,2024-07-11,0,1
2,ABC,None,Health Care,2023-08-02,0,0
3,ABI,None,Industrials,2005-01-01,0,0
4,ABKFQ,None,Financials,2005-01-01,0,0
...,...,...,...,...,...,...
931,XYL,Xylem Inc.,Industrials,2024-05-02,1,1
932,YUM,Yum! Brands,Consumer Discretionary,2024-05-01,1,1
933,ZBRA,Zebra Technologies,Information Technology,2024-04-30,1,1
934,ZBH,Zimmer Biomet,Health Care,2024-05-02,1,1
935,ZTS,Zoetis,Health Care,2024-04-29,1,1

In [6]:
fin_df = db_handler.fetch_financial_data("COST")
fin_df

,tic,datadate,rdq,saleq,cogsq,xsgaq,niq,ebitdaq,cshoq,actq,...,ltq,req,seqq,oancfq,ivncfq,fincfq,dvq,capxq,icaptq,surprise_pct
0,COST,2005-02-28,2005-03-02,12658.077,10945.950,1196.119,305.452,516.008,477.400,8363.116,...,7773.605,6663.558,8614.816,764.274,-834.941,269.429,47.094,409.498,9408.051,-0.011
1,COST,2005-05-31,2005-07-30,12006.210,10396.568,1186.410,209.788,423.232,479.287,8569.366,...,7862.059,6837.786,8862.878,493.627,-807.318,-8.469,47.733,218.559,9635.808,NaN
2,COST,2005-08-31,2005-09-01,16709.936,14498.178,1587.563,354.699,624.195,472.480,8086.438,...,7573.919,6782.193,8881.109,525.276,-416.470,-779.611,109.740,367.374,9650.398,0.015
3,COST,2005-11-30,2005-12-08,12933.346,11216.032,1277.680,215.818,439.634,475.828,8842.185,...,8255.657,6727.009,9067.032,137.570,-154.188,-31.921,0.000,272.568,9673.383,0.007
4,COST,2006-02-28,2006-03-02,14059.012,12185.283,1323.846,296.203,549.883,469.635,8452.130,...,8048.368,6656.469,9066.017,806.208,-223.362,-375.493,54.756,231.056,9664.196,0.028
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
73,COST,2023-05-31,2023-07-30,53648.000,47175.000,4794.000,1302.000,2151.000,444.360,34289.000,...,43179.000,18035.000,23573.000,1541.000,-1282.000,-735.000,399.000,NaN,30069.979,NaN
74,COST,2023-08-31,2023-09-26,78939.000,69219.000,6939.000,2160.000,3681.000,442.793,35879.000,...,43936.000,19521.000,25058.000,3725.000,-1825.000,-664.000,452.000,1556.000,31516.000,0.015
75,COST,2023-11-30,2023-12-14,57799.000,50457.000,5358.000,1589.000,2642.000,443.787,40080.000,...,47576.000,20499.000,26147.000,4651.000,-366.000,-974.000,905.000,1040.000,33093.000,0.047
76,COST,2024-02-29,2024-03-07,58442.000,51140.000,5240.000,1743.000,2761.000,443.504,32146.000,...,45563.000,14980.000,20760.000,731.000,-1386.000,-7276.000,NaN,1031.000,27705.000,0.082
77,COST,2024-05-31,2024-07-11,58515.000,51173.000,5145.000,1681.000,2821.000,443.335,33288.000,...,46140.000,15989.000,21771.000,2999.000,-954.000,-698.000,NaN,1062.000,28682.000,NaN

In [9]:
mkt_df = db_handler.fetch_market_data("AMZN")
mkt_df

       tic        date       close   adj_close     volume
0     AMZN  2005-01-03    2.226000    2.226000  208930000
1     AMZN  2005-01-04    2.107000    2.107000  388370000
2     AMZN  2005-01-05    2.088500    2.088500  167084000
3     AMZN  2005-01-06    2.052500    2.052500  174018000
4     AMZN  2005-01-07    2.116000    2.116000  196732000
...    ...         ...         ...         ...        ...
4908  AMZN  2024-07-05  200.000000  200.000000   39858900
4909  AMZN  2024-07-08  199.289993  199.289993   34767300
4910  AMZN  2024-07-09  199.339996  199.339996   32700100
4911  AMZN  2024-07-10  199.789993  199.789993   32829900
4912  AMZN  2024-07-11  194.949997  194.949997   22521916

[4913 rows x 5 columns]

In [7]:
ins_df = db_handler.fetch_insider_data("COST")
ins_df

,tic,filling_date,trade_date,owner_name,title,transaction_type,last_price,qty,shares_held,owned,value
0,COST,2003-08-13,2003-08-13,Evans Daniel J,Dir,P - Purchase,$30.30,"+1,000","2,000",+100%,"+$30,300"
1,COST,2003-09-02,2003-08-29,Petterson David S,Principal Accounting Officer,S - Sale,$32.24,"-5,000","5,000",-50%,"-$161,200"
2,COST,2003-10-22,2003-10-20,Brotman Jeffrey H,COB,S - Sale,$33.37,"-100,000","2,361,703",-4%,"-$3,337,000"
3,COST,2003-11-12,2003-11-11,Dicerchio Richard D,Senior EVP,S - Sale,$34.50,"-20,000","110,785",-15%,"-$690,000"
4,COST,2003-11-21,2003-11-20,Petterson David S,Principal Accounting Officer,S - Sale,$34.12,"-5,000",0,-100%,"-$170,623"
...,...,...,...,...,...,...,...,...,...,...,...
682,COST,2024-01-23,2024-01-23,Jelinek W Craig,Dir,S - Sale,$685.93,"-8,000","382,439",-2%,"-$5,487,456"
683,COST,2024-02-12,2024-02-09,Decker Susan L,Dir,S - Sale,$723.48,"-1,442","12,395",-10%,"-$1,043,257"
684,COST,2024-03-13,2024-03-11,Adamo Claudine,EVP,S - Sale,$714.83,"-1,500","6,695",-18%,"-$1,072,238"
685,COST,2024-03-13,2024-03-11,Callans Patrick J,EVP,S - Sale,$714.86,"-2,500","62,895",-4%,"-$1,787,150"
686,COST,2024-04-18,2024-04-17,Miller Russell D,Senior EVP,S - Sale,$722.86,-785,"10,002",-7%,"-$567,443"

In [3]:
# scrape GP and COST - > check date errors

import yfinance as yf

cost = yf.Ticker("GP")

earn = cost.get_earnings_dates()
earn

                           EPS Estimate  Reported EPS  Surprise(%)
Earnings Date
2025-06-30 08:00:00-04:00           NaN           NaN          NaN
2025-02-11 08:00:00-05:00           NaN           NaN          NaN
2024-11-12 08:00:00-05:00           NaN           NaN          NaN
2024-08-12 08:00:00-04:00         -0.22           NaN          NaN
2024-07-01 08:00:00-04:00           NaN           NaN          NaN
2024-06-27 20:00:00-04:00         -0.17         -0.27      -0.6168
2024-02-12 20:00:00-05:00         -0.13         -0.17      -0.2750
2023-11-13 22:00:00-05:00         -0.08         -0.17      -1.0000
2023-08-10 20:00:00-04:00         -0.11         -0.11       0.0222
2023-07-13 20:00:00-04:00         -0.12         -0.16      -0.3061
2023-02-13 17:00:00-05:00         -0.14         -0.14      -0.0182
2022-11-14 19:00:00-05:00         -0.16         -0.15       0.0385